{
    "1": {
        "question": "Каковы основные способы авторизации на платформе SMILE?",
        "keywords": "авторизация, платформа, способы"
    },
    "2": {
        "question": "Какие социальные сети поддерживаются для авторизации на платформе SMILE?",
        "keywords": "социальные, сети, авторизация, платформа"
    },
    "3": {
        "question": "Какие действия необходимо выполнить для авторизации через социальную сеть Яндекс?",
        "keywords": "авторизация, социальная, сеть, Яндекс"
    },
    "4": {
        "question": "Какие поля обязательны для заполнения при регистрации через стандартную форму?",
        "keywords": "регистрация, стандартная, форма, обязательны, поля"
    },
    "5": {
        "question": "Какие действия нужно выполнить после регистрации через стандартную форму, чтобы подтвердить почту?",
        "keywords": "регистрация, стандартная, форма, подтвердить, почту"
    },
    "6": {
        "question": "Какие данные необходимо ввести для авторизации после подтверждения почты?",
        "keywords": "данные, ввести, авторизация, подтверждение, почты"
    },
    "7": {
        "question": "Какие возможности предоставляет личный кабинет пользователя на платформе SMILE?",
        "keywords": "возможности, личный, кабинет, пользователь, платформа, SMILE"
    },
    "8": {
        "question": "Что можно настроить в личном кабинете пользователя SMILE?",
        "keywords": "настроить, личный, кабинет, пользователь, SMILE"
    },
    "9": {
        "question": "Какой дополнительный способ авторизации, кроме логина и пароля, доступен на платформе SMILE?",
        "keywords": "дополнительный, способ, авторизации, логин, пароль, доступен, платформа, SMILE"
    },
    "10": {
        "question": "Какой основной способ авторизации используется на платформе SMILE?",
        "keywords": "основной, способ, авторизации, входа, платформа, SMILE"
    },
    "11": {
        "question": "Какие возможности открываются пользователю после регистрации и авторизации на платформе SMILE?",
        "keywords": "возможности, регистрация, авторизация, платформа SMILE"
    },
    "12": {
        "question": "Какие права может иметь пользователь в команде на платформе SMILE?",
        "keywords": "права, пользователь, команда, платформа SMILE"
    },
    "13": {
        "question": "Как можно пригласить участников в команду на платформе SMILE?",
        "keywords": "пригласить, участников, команда, платформа SMILE"
    },
    "14": {
        "question": "Какие действия доступны руководителю команды на платформе SMILE?",
        "keywords": "действия, руководитель, команда, платформа SMILE"
    },
    "15": {
        "question": "Как можно создать собственную команду на платформе SMILE?",
        "keywords": "создать, собственную, команду, платформа SMILE"
    },
    "16": {
        "question": "Какие права могут быть предоставлены пользователю в рамках работы в команде на платформе SMILE?",
        "keywords": "права, пользователь, работа, команда, платформа SMILE"
    },
    "17": {
        "question": "Какую информацию можно получить о командах в личном кабинете пользователя на платформе SMILE?",
        "keywords": "информация, команды, личный кабинет, пользователь, платформа SMILE"
    },
    "18": {
        "question": "Какие роли могут быть у пользователя в команде на платформе SMILE?",
        "keywords": "роли, пользователь, команда, платформа SMILE"
    },
    "19": {
        "question": "Что может делать пользователь с правами редактора в команде на платформе SMILE?",
        "keywords": "делать, пользователь, права, редактор, команда, платформа SMILE"
    },
    "20": {
        "question": "Что может делать пользователь с правами читателя в команде на платформе SMILE?",
        "keywords": "делать, пользователь, права, читатель, команда, платформа SMILE"
    },
    "21": {
        "question": "Что отображается на главной странице платформы SMILE?",
        "keywords": "главная страница, платформа, SMILE"
    },
    "22": {
        "question": "Как пользователь может открыть доступный ему проект на платформе SMILE?",
        "keywords": "пользователь, доступ, проект, платформа, SMILE"
    },
    "23": {
        "question": "Какие функции доступны для навигации по проектам на платформе SMILE?",
        "keywords": "функции, навигация, проекты, платформа, SMILE"
    },
    "24": {
        "question": "Как работает фильтр по тегам на платформе SMILE?",
        "keywords": "фильтр, теги, платформа, SMILE"
    },
    "25": {
        "question": "Как можно найти проект по названию на платформе SMILE?",
        "keywords": "найти, проект, название, платформа, SMILE"
    },
    "26": {
        "question": "Какой функционал предоставляет фильтр по автору на платформе SMILE?",
        "keywords": "фильтр, автор, платформа, SMILE"
    },
    "27": {
        "question": "Как можно настроить параметры и направления сортировки проектов на платформе SMILE?",
        "keywords": "настроить, параметры, направления, сортировки, проекты, платформа, SMILE"
    },
    "28": {
        "question": "Какие проекты и модули доступны новому пользователю на платформе SMILE?",
        "keywords": "проекты, модули, доступность, новый, пользователь, платформа, SMILE"
    },
    "29": {
        "question": "Что такое публичные проекты и графы на платформе SMILE?",
        "keywords": "публичные, проекты, графы, платформа, SMILE"
    },
    "30": {
        "question": "Какие действия можно выполнять с публичными графами на платформе SMILE?",
        "keywords": "действия, публичные, графы, платформа, SMILE"
    },
    "31": {
        "question": "Что отображается на вкладке Данные для нового пользователя на платформе SMILE?",
        "keywords": "вкладка, Данные, новый, пользователь, платформа, SMILE"
    },
    "32": {
        "question": "Как отображаются загруженные данные на вкладке Данные?",
        "keywords": "загруженные, данные, вкладке, Данные"
    },
    "33": {
        "question": "Что показывает страница Загрузки вычислительных ресурсов на платформе SMILE?",
        "keywords": "страница, Загрузки, вычислительных, ресурсов, платформа, SMILE"
    },
    "34": {
        "question": "Какие приоритеты вычислительных ресурсов указаны по умолчанию на платформе SMILE?",
        "keywords": "приоритеты, вычислительных, ресурсов, по, умолчанию, платформа, SMILE"
    },
    "35": {
        "question": "Что означает красное выделение вычислительных ресурсов на платформе SMILE?",
        "keywords": "означает, красное, выделение, вычислительных, ресурсов, платформа, SMILE"
    },
    "36": {
        "question": "Где можно найти историю загрузки ресурсов на платформе SMILE?",
        "keywords": "история, загрузка, ресурсов, платформа, SMILE"
    },
    "37": {
        "question": "Какая информация доступна на странице Модели платформы SMILE?",
        "keywords": "информация, доступна, страница, Модели, платформа, SMILE"
    },
    "38": {
        "question": "Какие данные можно узнать о моделях на странице Модели платформы SMILE?",
        "keywords": "данные, узнать, моделях, страница, Модели, платформа, SMILE"
    },
    "39": {
        "question": "Что содержит раздел Руководство пользователя на платформе SMILE?",
        "keywords": "содержание, раздел, Руководство, пользователь, платформа, SMILE"
    },
    "40": {
        "question": "Какие основные сущности существуют при работе на платформе SMILE?",
        "keywords": "основные, сущности, работа, платформа, SMILE"
    },
    "41": {
        "question": "Что такое Проект на платформе SMILE?",
        "keywords": "Проект, платформа, SMILE"
    },
    "42": {
        "question": "Что такое Модуль на платформе SMILE?",
        "keywords": "Модуль, платформа, SMILE"
    },
    "43": {
        "question": "Какие шаги нужно выполнить для создания нового проекта на платформе SMILE?",
        "keywords": "шаги, выполнить, создание, проекта, платформа, SMILE"
    },
    "44": {
        "question": "Какие поля рекомендуется заполнять при создании проекта на платформе SMILE?",
        "keywords": "рекомендуется, заполнять, создание, проекта, платформа, SMILE"
    },
    "45": {
        "question": "Как создаётся модуль в рамках проекта на платформе SMILE?",
        "keywords": "создается, модуль, проект, платформа, SMILE"
    },
    "46": {
        "question": "Для чего используются теги при создании проекта или модуля на платформе SMILE?",
        "keywords": "теги, проект, модуль, платформа SMILE"
    },
    "47": {
        "question": "Где можно создать Проект или Модуль на платформе SMILE?",
        "keywords": "создать, Проект, Модуль, платформа SMILE"
    },
    "48": {
        "question": "Какие поля необходимо заполнить при создании Проекта и Модуля на платформе SMILE?",
        "keywords": "поля, заполнить, создание, Проект, Модуль, платформа SMILE"
    },
    "49": {
        "question": "Какие типы проектов бывают на платформе SMILE?",
        "keywords": "типы, проекты, платформа SMILE"
    },
    "50": {
        "question": "Какие уровни доступа могут иметь участники Проекта или Модуля на платформе SMILE?",
        "keywords": "уровни, доступа, участники, Проект, Модуль, платформа SMILE"
    },
    "51": {
        "question": "Что представляет собой рабочее пространство пользователя платформы SMILE?",
        "keywords": "пространство, пользователь, платформа, SMILE"
    },
    "52": {
        "question": "Из каких основных элементов состоит граф на платформе SMILE?",
        "keywords": "основные, элементы, граф, платформа, SMILE"
    },
    "53": {
        "question": "Что представляют собой Узлы графа на платформе SMILE?",
        "keywords": "Узлы, граф, платформа, SMILE"
    },
    "54": {
        "question": "Какие данные могут быть Признаками в Модуле на платформе SMILE?",
        "keywords": "данные, Признаки, Модуле, платформа, SMILE"
    },
    "55": {
        "question": "Какую роль выполняют Модели в графе на платформе SMILE?",
        "keywords": "Модели, роль, граф, платформа, SMILE"
    },
    "56": {
        "question": "Какова функция Ребер в рабочем пространстве платформы SMILE?",
        "keywords": "Ребер, функция, рабочее пространство, платформа SMILE"
    },
    "57": {
        "question": "Почему направление Ребра важно при соединении Узлов на графе SMILE?",
        "keywords": "Ребра, направление, соединение, Узлов, граф, SMILE"
    },
    "58": {
        "question": "Какие основные вкладки имеются в рабочем пространстве пользователя на платформе SMILE?",
        "keywords": "вкладки, рабочее пространство, пользователь, платформа SMILE"
    },
    "59": {
        "question": "Для чего предназначена вкладка Данные в рабочем пространстве SMILE?",
        "keywords": "вкладка Данные, рабочее пространство, SMILE"
    },
    "60": {
        "question": "Какие действия можно выполнять на вкладке Редактор в рабочем пространстве SMILE?",
        "keywords": "действия, вкладка Редактор, рабочее пространство, SMILE"
    },
    "61": {
        "question": "Что позволяет делать вкладка Анализ данных на платформе SMILE?",
        "keywords": "вкладка, Анализ, данные, платформа, SMILE"
    },
    "62": {
        "question": "Какие форматы отображения данных доступны на вкладке Анализ данных на платформе SMILE?",
        "keywords": "форматы, отображения, данных, доступны, вкладка, Анализ, данные, платформа, SMILE"
    },
    "63": {
        "question": "Какую функцию выполняет вкладка Вычисления в рабочем пространстве SMILE?",
        "keywords": "вкладка, Вычисления, рабочее, пространство, SMILE"
    },
    "64": {
        "question": "Какие возможности предоставляет вкладка Вычисления на платформе SMILE?",
        "keywords": "возможности, предоставляет, вкладка, Вычисления, платформа, SMILE"
    },
    "65": {
        "question": "Для чего используется вкладка Описание в рабочем пространстве SMILE?",
        "keywords": "используется, вкладка, Описание, рабочее, пространство, SMILE"
    },
    "66": {
        "question": "Какая информация может быть размещена на вкладке Описание на платформе SMILE?",
        "keywords": "информация, размещена, вкладка, Описание, платформа, SMILE"
    },
    "67": {
        "question": "Как можно добавлять и обрабатывать данные в редакторе графа на платформе SMILE?",
        "keywords": "добавлять, обрабатывать, данные, редактор, граф, платформа, SMILE"
    },
    "68": {
        "question": "Какие виды графиков можно использовать на вкладке Анализ данных на платформе SMILE?",
        "keywords": "виды, графиков, использовать, вкладка, Анализ, данных, платформа, SMILE"
    },
    "69": {
        "question": "Какие параметры моделей можно изменять на вкладке Вычисления в рабочем пространстве SMILE?",
        "keywords": "параметры, моделей, изменять, вкладка, Вычисления, рабочее, пространство, SMILE"
    },
    "70": {
        "question": "Как просматривать результаты вычислений на платформе SMILE?",
        "keywords": "просматривать, результаты, вычислений, платформа, SMILE"
    },
    "71": {
        "question": "Что такое вычислительный граф на платформе SMILE?",
        "keywords": "вычислительный граф, платформа SMILE"
    },
    "72": {
        "question": "Какие два типа узлов существуют в вычислительном графе SMILE?",
        "keywords": "два типа узлов, вычислительный граф, SMILE"
    },
    "73": {
        "question": "Какую функцию выполняют узлы данных в вычислительном графе SMILE?",
        "keywords": "узлы данных, функцию, вычислительный граф, SMILE"
    },
    "74": {
        "question": "Что происходит при нажатии на узел данных в графе SMILE?",
        "keywords": "нажатие, узел данных, граф SMILE"
    },
    "75": {
        "question": "Какую функцию выполняют узлы моделей в вычислительном графе SMILE?",
        "keywords": "узлы моделей, функцию, вычислительный граф, SMILE"
    },
    "76": {
        "question": "Что такое обычные ребра в вычислительном графе SMILE и для чего они используются?",
        "keywords": "обычные ребра, вычислительный граф, SMILE, используются"
    },
    "77": {
        "question": "Какую роль выполняют Apply ребра в вычислительном графе SMILE?",
        "keywords": "Apply ребра, роль, вычислительный граф, SMILE"
    },
    "78": {
        "question": "Какого цвета узлы данных в графе SMILE?",
        "keywords": "узлы данных, цвета, граф, SMILE"
    },
    "79": {
        "question": "Какого цвета узлы моделей в графе SMILE?",
        "keywords": "узлы моделей, цвета, граф, SMILE"
    },
    "80": {
        "question": "Как визуализируются данные при нажатии на узел данных в графе SMILE?",
        "keywords": "визуализируются, данные, узел данных, граф, SMILE"
    },
    "81": {
        "question": "Как платформа SMILE оптимизирует скорость работы с данными?",
        "keywords": "платформа SMILE, оптимизирует, скорость, работа, данные"
    },
    "82": {
        "question": "Как пользователь может анализировать данные в узле данных на платформе SMILE?",
        "keywords": "пользователь, анализировать, данные, узел данных, платформа SMILE"
    },
    "83": {
        "question": "Что происходит, когда узел данных или узел модели запускается в графе SMILE?",
        "keywords": "узел данных, узел модели, запускается, граф, SMILE"
    },
    "84": {
        "question": "Как можно отфильтровать признаки в узле данных на платформе SMILE?",
        "keywords": "отфильтровать, признаки, узел данных, платформа SMILE"
    },
    "85": {
        "question": "Как происходит фильтрация признаков в обычном ребре на платформе SMILE?",
        "keywords": "фильтрация, признаков, ребро, платформа SMILE"
    },
    "86": {
        "question": "Какие параметры модели можно изменить в узле модели на платформе SMILE?",
        "keywords": "параметры, модель, изменить, узел, платформа, SMILE"
    },
    "87": {
        "question": "Что означает, если узел модели выделен темно-зеленым цветом?",
        "keywords": "узел, модель, выделен, цветом"
    },
    "88": {
        "question": "Что происходит после завершения расчета узла модели на платформе SMILE?",
        "keywords": "завершения, расчета, узла, модель, платформа, SMILE"
    },
    "89": {
        "question": "Как применить обученную модель к новым данным с помощью Apply ребра?",
        "keywords": "применить, обученная, модель, новые, данные, Apply, ребро"
    },
    "90": {
        "question": "Какова функция целевого столбца в узле модели на платформе SMILE?",
        "keywords": "функция, целевой, столбец, узел, модель, платформа, SMILE"
    },
    "91": {
        "question": "Каковы параметры размера тестовой и тренировочной выборок (test_size и train_size) в узле модели?",
        "keywords": "параметры, размеры, тестовая, тренировочная, выборки, test_size, train_size, узел, модель"
    },
    "92": {
        "question": "Как можно изменить параметры узла модели на платформе SMILE?",
        "keywords": "параметры, изменить, узел, модель, платформа, SMILE"
    },
    "93": {
        "question": "Что происходит, если изменить параметр в узле модели после его запуска?",
        "keywords": "параметр, изменить, узел, модель, после, запуска"
    },
    "94": {
        "question": "Какие результаты отображаются для рассчитанной модели на платформе SMILE?",
        "keywords": "результаты, отображаются, рассчитанная, модель, платформа, SMILE"
    },
    "95": {
        "question": "Как просматривать результаты предсказаний (predict) и вероятностей (prob) для рассчитанной модели?",
        "keywords": "просматривать, результаты, предсказаний, predict, вероятностей, prob, рассчитанная, модель"
    },
    "96": {
        "question": "Что делать, если необходимо пересчитать модель после изменения параметров?",
        "keywords": "пересчитать, модель, изменение, параметров"
    },
    "97": {
        "question": "Как запускать узлы графа поочередно или весь граф целиком на платформе SMILE?",
        "keywords": "запускать, узлы, графа, поочередно, целиком, платформа, SMILE"
    },
    "98": {
        "question": "Что значит перезагрузить граф и как это сделать на платформе SMILE?",
        "keywords": "перезагрузить, граф, сделать, платформа, SMILE"
    },
    "99": {
        "question": "Какие данные могут быть отображены в различных датафреймах (dataframe) на платформе SMILE?",
        "keywords": "данные, датафреймах, dataframe, платформа, SMILE"
    },
    "100": {
        "question": "Как работает функция запуска самого последнего узла модели для пересчета всех родительских элементов на платформе SMILE?",
        "keywords": "функция, запуска, последний, узел, модели, пересчет, родительских, элементов, платформа, SMILE"
    },
    "101": {
        "question": "Как загрузить датасет во вкладке \"Данные\" рабочего пространства на платформе SMILE?",
        "keywords": "загрузить, датасет, вкладка, Данные, рабочее пространство, платформа, SMILE"
    },
    "102": {
        "question": "Какие типы файлов поддерживаются для загрузки данных на платформу SMILE?",
        "keywords": "типы файлов, поддерживаются, загрузка, данных, платформа, SMILE"
    },
    "103": {
        "question": "Какие типы разделителей поддерживаются для .csv файлов на платформе SMILE?",
        "keywords": "типы разделителей, поддерживаются, .csv файлы, платформа, SMILE"
    },
    "104": {
        "question": "Что произойдет, если Excel файл содержит несколько страниц при загрузке на платформу SMILE?",
        "keywords": "Excel файл, содержит, несколько, страниц, загрузка, платформа, SMILE"
    },
    "105": {
        "question": "Что происходит при загрузке архива на платформу SMILE?",
        "keywords": "загрузка, архива, платформа, SMILE"
    },
    "106": {
        "question": "Какие типы изображений поддерживаются для загрузки на платформу SMILE?",
        "keywords": "типы, изображений, поддерживаются, загрузка, платформа, SMILE"
    },
    "107": {
        "question": "Как обрабатываются изображения после загрузки на платформу SMILE?",
        "keywords": "обработка, изображения, после, загрузки, платформа, SMILE"
    },
    "108": {
        "question": "Каков максимальный размер загружаемого файла на платформу SMILE?",
        "keywords": "максимальный, размер, файла, загрузка, платформа, SMILE"
    },
    "109": {
        "question": "Как можно использовать готовые наборы данных, предварительно загруженные на платформу SMILE?",
        "keywords": "готовые, наборы, данных, предварительно, загружены, платформа, SMILE"
    },
    "110": {
        "question": "Как добавить узел \"Модель\" из группы \"Datasets\" в редактор графа?",
        "keywords": "добавить, узел, Модель, группа, Datasets, редактор, графа"
    },
    "111": {
        "question": "Что нужно сделать после добавления датасета во вкладке \"Данные\" для его дальнейшего использования в редакторе?",
        "keywords": "добавление, датасета, вкладка, Данные, дальнейшее, использование, редакторе"
    },
    "112": {
        "question": "Как добавить узел данных на граф в редакторе рабочего пространства SMILE?",
        "keywords": "добавить, узел, данных, граф, редакторе, рабочего, пространства, SMILE"
    },
    "113": {
        "question": "Какие действия нужно выполнить после нажатия кнопки \"Новый узел данных\" для добавления узлов данных на граф?",
        "keywords": "нажатие, кнопки, \"Новый, узел, данных\", добавления, узлов, данных, граф"
    },
    "114": {
        "question": "Как завершить добавление узлов данных на граф в редакторе рабочего пространства SMILE?",
        "keywords": "завершить, добавление, узлов, данных, граф, редакторе, рабочего, пространства, SMILE"
    },
    "115": {
        "question": "Как настроить используемые столбцы датасета после добавления узла данных на граф?",
        "keywords": "настроить, используемые, столбцы, датасета, добавления, узла, данных, граф"
    },
    "116": {
        "question": "Что происходит при нажатии на узел данных в редакторе рабочего пространства SMILE?",
        "keywords": "нажатие, узел, данные, редактор, пространство, SMILE"
    },
    "117": {
        "question": "Как выбрать столбец для нумерации, идентификации или индексирования данных в узле данных?",
        "keywords": "выбрать, столбец, нумерация, идентификация, индексирование, данные, узел"
    },
    "118": {
        "question": "Как выбрать все столбцы датасета для дальнейшей работы в узле данных?",
        "keywords": "выбрать, столбцы, датасет, работа, узел, данных"
    },
    "119": {
        "question": "Что означает поле \"Индекс столбец\" в панели управления узлом данных?",
        "keywords": "поле, Индекс, столбец, панель, управления, узел, данных"
    },
    "120": {
        "question": "Как настроить использование конкретных столбцов в узле данных?",
        "keywords": "настроить, использование, столбцов, узел, данных"
    },
    "121": {
        "question": "Какие данные можно просмотреть после загрузки датасета во вкладке \"Данные\"?",
        "keywords": "данные, загрузка, датасет, вкладка"
    },
    "122": {
        "question": "Как удалить загруженный датасет из системы на платформе SMILE?",
        "keywords": "удалить, датасет, платформа, SMILE"
    },
    "123": {
        "question": "Что произойдет, если не поставить галочку \"Выбрано\" у загруженного датасета во вкладке \"Данные\"?",
        "keywords": "галочку, выбрано, датасет, вкладка"
    },
    "124": {
        "question": "Как проверить, что новый загруженный датасет выбран по умолчанию?",
        "keywords": "новый, датасет, выбран, по умолчанию"
    },
    "125": {
        "question": "Какие действия необходимы для создания узла данных в редакторе рабочего пространства SMILE с помощью клавиши \"D\"?",
        "keywords": "создать, узел, данных, редактор, рабочее, пространство, SMILE, клавиша"
    },
    "126": {
        "question": "Что происходит при нажатии на кнопку \"Завершить добавление\" или клавишу \"ESC\" в редакторе рабочего пространства SMILE?",
        "keywords": "нажатие, кнопка, Завершить, добавление, клавиша, ESC, редактор, рабочее, пространство, SMILE"
    },
    "127": {
        "question": "Как настроить используемые столбцы датасета для дальнейшей работы с моделью машинного обучения?",
        "keywords": "настроить, используемые, столбцы, датасета, дальнейшая, работа, модель, машинного, обучения"
    },
    "128": {
        "question": "Как визуализируются данные после добавления узла данных на граф?",
        "keywords": "визуализируются, данные, добавление, узла, данных, граф"
    },
    "129": {
        "question": "Какую вкладку нужно открыть, чтобы загрузить данные в модуль на платформе SMILE?",
        "keywords": "вкладка, загрузить, данные, модуль, платформа, SMILE"
    },
    "130": {
        "question": "Какая кнопка позволяет начать загрузку нового файла в модуль?",
        "keywords": "кнопка, начать, загрузку, нового, файла, модуль"
    },
    "131": {
        "question": "Что нужно сделать после нажатия на кнопку \"Загрузка нового файла\"?",
        "keywords": "кнопка, загрузка, новый, файл"
    },
    "132": {
        "question": "Какие типы файлов можно загрузить в модуль на платформе SMILE?",
        "keywords": "типы, файлов, загрузить, модуль, платформа, SMILE"
    },
    "133": {
        "question": "Как узнать, что файл был успешно загружен на платформу?",
        "keywords": "файл, успешно, загружен, платформа"
    },
    "134": {
        "question": "Где отображается загруженный файл после завершения загрузки?",
        "keywords": "отображается, загруженный, файл, завершения, загрузки"
    },
    "135": {
        "question": "Что произойдет, если не выбрать загруженный файл для работы?",
        "keywords": "выбрать, загруженный, файл, работа"
    },
    "136": {
        "question": "Как можно просмотреть подробную информацию о загруженном файле?",
        "keywords": "файл, информация, подробная"
    },
    "137": {
        "question": "Какие действия можно выполнить с загруженным файлом в общем списке файлов?",
        "keywords": "файл, действия, список"
    },
    "138": {
        "question": "Как сделать загруженный файл доступным для использования в других модулях и проектах на платформе SMILE?",
        "keywords": "файл, доступный, модули, проекты, платформа"
    },
    "139": {
        "question": "Как добавить новый узел модели на граф в Редакторе?",
        "keywords": "узел, модель, добавить, граф, Редактор"
    },
    "140": {
        "question": "Какие клавиши можно использовать для добавления узла модели?",
        "keywords": "узел, добавить, клавиши"
    },
    "141": {
        "question": "Что необходимо сделать после добавления нужного количества узлов моделей?",
        "keywords": "необходимое, количество, узлов, моделей, сделать"
    },
    "142": {
        "question": "Где находятся настройки для узла модели в Редакторе?",
        "keywords": "настройки, узел, модели, Редакторе"
    },
    "143": {
        "question": "Какой функционал доступен в панели управления узлом модели?",
        "keywords": "функционал, доступен, панели, управления, узлом, модели"
    },
    "144": {
        "question": "Как выбрать нужный алгоритм в узле модели?",
        "keywords": "выбрать, алгоритм, узле, модели"
    },
    "145": {
        "question": "Какие категории моделей существуют на платформе SMILE?",
        "keywords": "категории, моделей, платформа, SMILE"
    },
    "146": {
        "question": "Что можно сделать, если нужный алгоритм не отображается в списке?",
        "keywords": "алгоритм, не, отображается, списке"
    },
    "147": {
        "question": "Какие параметры можно настроить для выбранной модели?",
        "keywords": "параметры, настроить, выбранная, модель"
    },
    "148": {
        "question": "Как соединить узлы на графе в Редакторе?",
        "keywords": "соединить, узлы, графе, Редакторе"
    },
    "149": {
        "question": "Какие клавиши можно использовать для создания нового ребра?",
        "keywords": "клавиши, использовать, создание, нового, ребра"
    },
    "150": {
        "question": "Как завершить добавление ребер после их создания?",
        "keywords": "завершить, добавление, ребер, после, создания"
    },
    "151": {
        "question": "Какое направление имеют ребра на платформе SMILE?",
        "keywords": "направление, ребра, платформа, SMILE"
    },
    "152": {
        "question": "Какие узлы могут быть соединены ребрами?",
        "keywords": "узлы, соединены, ребрами"
    },
    "153": {
        "question": "Как настроить ребро в качестве фильтра?",
        "keywords": "ребро, настроить, фильтр"
    },
    "154": {
        "question": "Какие признаки можно настроить в ребре?",
        "keywords": "признаки, настроить, ребро"
    },
    "155": {
        "question": "Как запустить расчет графа в Редакторе?",
        "keywords": "запустить, расчет, граф, Редакторе"
    },
    "156": {
        "question": "Как рассчитать отдельные узлы на графе?",
        "keywords": "рассчитать, узлы, графе"
    },
    "157": {
        "question": "Какую информацию можно увидеть после расчета узлов?",
        "keywords": "информация, после, расчета, узлов"
    },
    "158": {
        "question": "Что произойдет, если изменить настройки модели после расчета узла?",
        "keywords": "изменить, настройки, модель, после, расчета, узла"
    },
    "159": {
        "question": "Какие модели входят в группу DataframeOperations на платформе SMILE?",
        "keywords": "модели, группа, DataframeOperations, платформа, SMILE"
    },
    "160": {
        "question": "Для чего предназначена модель DataframeRename?",
        "keywords": "модель, DataframeRename, предназначена"
    },
    "161": {
        "question": "Какие параметры можно задать в модели DataframeRename для переименования столбцов?",
        "keywords": "параметры, модель, DataframeRename, переименование, столбцов"
    },
    "162": {
        "question": "Какие типы выбора столбцов поддерживает параметр select_columns_by в модели DataframeMath?",
        "keywords": "типы, выбора, столбцов, параметр, select_columns_by, модель, DataframeMath"
    },
    "163": {
        "question": "Что означает параметр \"custom\" в модели DataframeMath для выбора столбцов?",
        "keywords": "параметр, \"custom\", модель, DataframeMath, выбора, столбцов"
    },
    "164": {
        "question": "Какие действия позволяет выполнять модель DataframeMath с использованием математических операций?",
        "keywords": "действия, модель, DataframeMath, математических, операций"
    },
    "165": {
        "question": "Какие параметры необходимо задать для логарифмического преобразования нескольких признаков в модели DataframeMath?",
        "keywords": "параметры, логарифмическое, преобразование, признаков, модель, DataframeMath"
    },
    "166": {
        "question": "Как происходит выбор столбцов для логарифмического преобразования в модели DataframeMath при выборе \"NAME\"?",
        "keywords": "выбор, столбцов, логарифмического, преобразование, модель, DataframeMath, \"NAME\""
    },
    "167": {
        "question": "Какие типы данных поддерживаются для преобразования в целочисленные с помощью модели DataframeMath?",
        "keywords": "типы, данных, поддерживаются, преобразование, целочисленные, модель, DataframeMath"
    },
    "168": {
        "question": "Как изменить тип данных столбцов на целочисленный в модели DataframeMath для вещественных чисел?",
        "keywords": "изменить, тип, данных, столбцов, целочисленный, модель, DataframeMath, вещественных, чисел"
    },
    "169": {
        "question": "Каким образом модель DataframeMath выполняет сортировку данных по индексу?",
        "keywords": "модель, DataframeMath, выполняет, сортировку, данных, индексу"
    },
    "170": {
        "question": "Какие параметры необходимо задать для сортировки набора данных по индексу с помощью модели DataframeMath?",
        "keywords": "параметры, задать, сортировки, набора, данных, индексу, модель, DataframeMath"
    },
    "171": {
        "question": "Что происходит при сортировке данных по значениям столбца с помощью модели DataframeMath?",
        "keywords": "сортировка, данные, значения, столбец, DataframeMath"
    },
    "172": {
        "question": "Какие дополнительные действия можно выполнить после преобразования данных с помощью моделей DataframeRename и DataframeMath?",
        "keywords": "дополнительные, действия, преобразование, данных, DataframeRename, DataframeMath"
    },
    "173": {
        "question": "Какие выражения могут использоваться в параметре expression модели DataframeMath для сложных математических операций?",
        "keywords": "выражения, параметр, expression, DataframeMath, математических, операций"
    },
    "174": {
        "question": "Какие выгоды предоставляет возможность выбора столбцов по типу данных в модели DataframeMath?",
        "keywords": "выгоды, выбор, столбцов, тип, данных, DataframeMath"
    },
    "175": {
        "question": "Как можно настроить модель DataframeMath для преобразования данных вещественного типа с использованием пользовательского выражения?",
        "keywords": "настроить, модель, DataframeMath, преобразование, данных, вещественного, типа, пользовательского, выражения"
    },
    "176": {
        "question": "Какие ограничения или особенности имеются при работе с моделями DataframeOperations - DataframeMath на платформе SMILE?",
        "keywords": "ограничения, особенности, модели, DataframeOperations, DataframeMath, платформа, SMILE"
    },
    "177": {
        "question": "Что такое модель DataframeFilter и для чего она используется?",
        "keywords": "модель, DataframeFilter, используется"
    },
    "178": {
        "question": "Какие параметры принимает модель DataframeFilter?",
        "keywords": "параметры, модель, DataframeFilter"
    },
    "179": {
        "question": "Какой формат должен быть у параметра column в модели DataframeFilter?",
        "keywords": "параметр, column, модель, DataframeFilter"
    },
    "180": {
        "question": "Как задать условие сравнения в модели DataframeFilter?",
        "keywords": "условие, сравнения, модель, DataframeFilter"
    },
    "181": {
        "question": "Что означает параметр column_to в модели DataframeFilter?",
        "keywords": "параметр, column_to, модели, DataframeFilter"
    },
    "182": {
        "question": "Каким образом задается значение для сравнения в модели DataframeFilter?",
        "keywords": "значение, сравнение, модели, DataframeFilter"
    },
    "183": {
        "question": "Как использовать пользовательское выражение в модели DataframeFilter?",
        "keywords": "пользовательское, выражение, модели, DataframeFilter"
    },
    "184": {
        "question": "В чем разница между параметрами value и expression в модели DataframeFilter?",
        "keywords": "параметры, value, expression, модели, DataframeFilter"
    },
    "185": {
        "question": "Какой эффект оказывает параметр reset_index в модели DataframeFilter?",
        "keywords": "параметр, reset_index, модели, DataframeFilter"
    },
    "186": {
        "question": "Как модель DataframeFilter обрабатывает синтаксические ошибки в пользовательских выражениях?",
        "keywords": "модель, DataframeFilter, обрабатывает, синтаксические, ошибки, пользовательские, выражения"
    },
    "187": {
        "question": "Какие типы операций поддерживает модель DataframeGroupBy?",
        "keywords": "модель, DataframeGroupBy, типы, операций, поддерживает"
    },
    "188": {
        "question": "Какие параметры необходимы для выполнения группировки в модели DataframeGroupBy?",
        "keywords": "модель, DataframeGroupBy, параметры, необходимы, группировка"
    },
    "189": {
        "question": "Что делает параметр as-index в модели DataframeGroupBy?",
        "keywords": "параметр, as-index, модель, DataframeGroupBy"
    },
    "190": {
        "question": "Какая разница между внутренним и внешним объединением в модели DataframeMerge?",
        "keywords": "разница, внутренний, внешний, объединение, модель, DataframeMerge"
    },
    "191": {
        "question": "Как задать столбцы для слияния в модели DataframeMerge?",
        "keywords": "столбцы, слияние, модель, DataframeMerge"
    },
    "192": {
        "question": "В чем заключается функциональность модели DataframeConcat?",
        "keywords": "функциональность, модель, DataframeConcat"
    },
    "193": {
        "question": "Какие параметры определяют порядок объединения строк в модели DataframeConcat?",
        "keywords": "параметры, порядок, объединения, строк, модель, DataframeConcat"
    },
    "194": {
        "question": "Для чего используется модель DataframeReset?",
        "keywords": "модель, DataframeReset"
    },
    "195": {
        "question": "Какие направления сброса поддерживает модель DataframeReset?",
        "keywords": "направления, сброса, модель, DataframeReset"
    },
    "196": {
        "question": "Что делает модель DropByNone и какие у нее параметры?",
        "keywords": "модель, DropByNone, параметры"
    },
    "197": {
        "question": "Какие основные цели предварительной обработки данных на платформе SMILE?",
        "keywords": "цели, предварительная обработка, данные, платформа, SMILE"
    },
    "198": {
        "question": "Какие модели используются для обработки данных в узлах \"Модели\" на платформе SMILE?",
        "keywords": "модели, обработка, данные, узлы, Модели, платформа, SMILE"
    },
    "199": {
        "question": "Можно ли применять алгоритмы обработки данных последовательно друг за другом на платформе SMILE?",
        "keywords": "алгоритмы, обработка, данных, последовательно, платформа, SMILE"
    },
    "200": {
        "question": "Как осуществляется  обработки данных на платформе SMILE?",
        "keywords": "обработка, данных, платформа, SMILE"
    },
    "201": {
        "question": "Каким образом формируются новые столбцы после работы моделей обработки данных на платформе SMILE?",
        "keywords": "формируются, новые, столбцы, модели, обработки, данных, платформа, SMILE"
    },
    "202": {
        "question": "Что такое отсутствующее значение в наборе данных?",
        "keywords": "отсутствующее, значение, набор, данных"
    },
    "203": {
        "question": "Почему важно правильно обрабатывать отсутствующие значения?",
        "keywords": "важно, правильно, обрабатывать, отсутствующие, значения"
    },
    "204": {
        "question": "Какие модели категории Imputer используются для работы с отсутствующими значениями на платформе SMILE?",
        "keywords": "модели, категории, Imputer, отсутствующие, значения, платформа, SMILE"
    },
    "205": {
        "question": "Что такое категориальный признак в наборе данных?",
        "keywords": "категориальный, признак, набор, данных"
    },
    "206": {
        "question": "Почему необходимо кодировать категориальные признаки?",
        "keywords": "кодировать, категориальные, признаки"
    },
    "207": {
        "question": "Какие модели категории Encoder используются для работы с категориальными признаками на платформе SMILE?",
        "keywords": "модели, Encoder, категориальные, признаки, платформа, SMILE"
    },
    "208": {
        "question": "Что представляют собой аномальные значения в наборе данных?",
        "keywords": "аномальные, значения, набор, данных"
    },
    "209": {
        "question": "Как их можно обнаружить и обработать на платформе SMILE?",
        "keywords": "обнаружить, обработать, платформа, SMILE"
    },
    "210": {
        "question": "Какие модели категории OutlierModel используются для работы с аномальными значениями на платформе SMILE?",
        "keywords": "модели, OutlierModel, аномальные, значения, платформа, SMILE"
    },
    "211": {
        "question": "Что такое масштабирование выборки данных?",
        "keywords": "масштабирование, выборка, данных"
    },
    "212": {
        "question": "Какие модели применяются на платформе SMILE для масштабирования выборки данных?",
        "keywords": "модели, платформа, SMILE, масштабирование, выборка, данные"
    },
    "213": {
        "question": "Как пользователь может самостоятельно совершать операции с набором данных на платформе SMILE?",
        "keywords": "пользователь, операции, набор, данных, платформа, SMILE"
    },
    "214": {
        "question": "Какие модели категории DataFrameOperations являются наиболее популярным?",
        "keywords": "модели, категория, DataFrameOperations, популярный"
    },
    "215": {
        "question": "Какую задачу решает модель DataFrameDropDuplicates на платформе SMILE?",
        "keywords": "задача, модель, DataFrameDropDuplicates, платформа, SMILE"
    },
    "216": {
        "question": "Какие математические операции можно выполнять с помощью модели DataFrameMath на платформе SMILE?",
        "keywords": "математические операции, модель, DataFrameMath, платформа, SMILE"
    },
    "217": {
        "question": "Что делает модель DataFrameRename в узле моделей на платформе SMILE?",
        "keywords": "модель, DataFrameRename, узле моделей, платформа, SMILE"
    },
    "218": {
        "question": "Какую функцию выполняет модель DataFrameReplace на платформе SMILE?",
        "keywords": "функцию, модель, DataFrameReplace, платформа, SMILE"
    },
    "219": {
        "question": "Как модель LabelEncoder кодирует категориальные признаки на платформе SMILE?",
        "keywords": "модель, LabelEncoder, кодирует, категориальные признаки, платформа, SMILE"
    },
    "220": {
        "question": "В чем разница между OneHotEncoder и OrdinalEncoder при работе с категориальными данными на платформе SMILE?",
        "keywords": "разница, OneHotEncoder, OrdinalEncoder, категориальными данными, платформа, SMILE"
    },
    "221": {
        "question": "Какие типы данных можно обрабатывать с помощью моделей категории OutlierModel на платформе SMILE?",
        "keywords": "типы данных, обрабатывать, модели, OutlierModel, платформа, SMILE"
    },
    "222": {
        "question": "Какие параметры можно настраивать при использовании модели KNNImputer для заполнения отсутствующих значений на платформе SMILE?",
        "keywords": "параметры, настраивать, модель, KNNImputer, заполнение, отсутствующих, значений, платформа, SMILE"
    },
    "223": {
        "question": "Какие основные задачи решает регрессионный анализ на платформе SMILE?",
        "keywords": "задачи, решает, регрессионный, анализ, платформа, SMILE"
    },
    "224": {
        "question": "Что такое зависимая переменная в задачах регрессии?",
        "keywords": "зависимая, переменная, задачи, регрессии"
    },
    "225": {
        "question": "Какие примеры задач регрессии можно решать с помощью моделей на платформе SMILE?",
        "keywords": "задачи, регрессии, модели, платформа, SMILE"
    },
    "226": {
        "question": "Что представляет собой задача классификации на платформе SMILE?",
        "keywords": "'классификация, платформа SMILE'"
    },
    "227": {
        "question": "Что такое классы в контексте задачи классификации на платформе SMILE?",
        "keywords": "'классы, задача классификации, платформа SMILE'"
    },
    "228": {
        "question": "Какие примеры задач классификации можно решать с помощью моделей на платформе SMILE?",
        "keywords": "'примеры задач, классификации, платформа SMILE'"
    },
    "229": {
        "question": "Какие модели категории ClassificationModel являются наиболее популярными на платформе SMILE?",
        "keywords": "'модели, ClassificationModel, популярные, платформа SMILE'"
    },
    "230": {
        "question": "Какие модели категории RegressionModel рекомендуется использовать для решения задачи регрессии на платформе SMILE?",
        "keywords": "'модели, RegressionModel, задача регрессии, платформа SMILE'"
    },
    "231": {
        "question": "Каким образом пользователь может применить модель классификации к данным в редакторе на платформе SMILE?",
        "keywords": "модель, классификация, данные, редактор, платформа, SMILE"
    },
    "232": {
        "question": "Какие шаги необходимо выполнить для разделения данных на тренировочную и тестовую выборки перед применением модели на платформе SMILE?",
        "keywords": "разделение, данные, тренировочная, тестовая, выборки, платформа, SMILE"
    },
    "233": {
        "question": "Что такое кросс-валидация и как она применяется в задачах машинного обучения на платформе SMILE?",
        "keywords": "кросс-валидация, задачи, машинного, обучения, платформа, SMILE"
    },
    "234": {
        "question": "Как пользователь может добавить модель в узел \"Модель\" на платформе SMILE для классификационных задач?",
        "keywords": "модель, узел, \"Модель\", платформа, SMILE, классификационные, задачи"
    },
    "235": {
        "question": "Какие данные соединяются с моделью после разделения на тренировочную и тестовую выборки на платформе SMILE?",
        "keywords": "данные, разделения, тренировочная, тестовая, выборки, платформа, SMILE"
    },
    "236": {
        "question": "Что делает модель LogisticRegression в задачах классификации на платформе SMILE?",
        "keywords": "модель, LogisticRegression, задачи, классификация, платформа, SMILE"
    },
    "237": {
        "question": "Какие метрики используются для оценки модели после обучения на тренировочных данных на платформе SMILE?",
        "keywords": "метрики, оценка, модель, обучение, тренировочные, данные, платформа, SMILE"
    },
    "238": {
        "question": "Почему оценка модели на тренировочных данных не является окончательной на платформе SMILE?",
        "keywords": "оценка, модель, тренировочные, данные, окончательная, платформа, SMILE"
    },
    "239": {
        "question": "Какие модели регрессии на платформе SMILE могут быть полезны для предсказания цен на финансовых рынках?",
        "keywords": "модели, регрессии, платформа, SMILE, предсказание, цены, финансовые, рынки"
    },
    "240": {
        "question": "Каким образом пользователь может интерпретировать результаты работы модели классификации на платформе SMILE?",
        "keywords": "пользователь, интерпретация, результаты, модель, классификация, платформа, SMILE"
    },
    "241": {
        "question": "Что такое метрики оценки моделей и зачем они используются в задачах классификации и регрессии на платформе SMILE?",
        "keywords": "метрики оценки, модели, задачи классификации, регрессии, платформа SMILE"
    },
    "242": {
        "question": "Какие основные числовые метрики используются для оценки моделей классификации на платформе SMILE?",
        "keywords": "числовые метрики, оценка, модели классификации, платформа SMILE"
    },
    "243": {
        "question": "Что показывает метрика Accuracy при оценке моделей классификации на платформе SMILE?",
        "keywords": "метрика Accuracy, оценка, модели классификации, платформа SMILE"
    },
    "244": {
        "question": "Что такое Precision и как она интерпретируется в контексте моделей классификации на платформе SMILE?",
        "keywords": "Precision, интерпретация, модели классификации, платформа SMILE"
    },
    "245": {
        "question": "Какая роль у метрики Recall в оценке качества моделей классификации на платформе SMILE?",
        "keywords": "метрика Recall, оценка качества, модели классификации, платформа SMILE"
    },
    "246": {
        "question": "Что представляет собой метрика F1 и почему она полезна при оценке моделей классификации на платформе SMILE?",
        "keywords": "метрика, F1, оценка, модели, классификации, платформа, SMILE"
    },
    "247": {
        "question": "Что такое ROC AUC и как она помогает в анализе результатов моделей классификации на платформе SMILE?",
        "keywords": "ROC, AUC, анализ, результаты, модели, классификации, платформа, SMILE"
    },
    "248": {
        "question": "Какие основные числовые метрики используются для оценки моделей регрессии на платформе SMILE?",
        "keywords": "числовые, метрики, оценка, модели, регрессии, платформа, SMILE"
    },
    "249": {
        "question": "Как интерпретируется метрика MSE при оценке моделей регрессии на платформе SMILE?",
        "keywords": "метрика, MSE, оценка, модели, регрессии, платформа, SMILE"
    },
    "250": {
        "question": "Что показывает метрика MAE и как она помогает в оценке качества моделей регрессии на платформе SMILE?",
        "keywords": "метрика, MAE, оценка, качество, модели, регрессии, платформа, SMILE"
    },
    "251": {
        "question": "Что представляет собой коэффициент детерминации R2 и как он используется при оценке моделей регрессии на платформе SMILE?",
        "keywords": "коэффициент, детерминации, R2, оценка, модели, регрессии, платформа, SMILE"
    },
    "252": {
        "question": "Какая роль у метрики MAPE в оценке моделей регрессии на платформе SMILE?",
        "keywords": "метрика, MAPE, оценка, модели, регрессии, платформа, SMILE"
    },
    "253": {
        "question": "Что представляет собой RMSE и в чем его преимущества при оценке моделей регрессии на платформе SMILE?",
        "keywords": "RMSE, преимущества, оценка, модели, регрессии, платформа, SMILE"
    },
    "254": {
        "question": "Как пользователь может оценить результаты модели классификации на тестовых данных на платформе SMILE?",
        "keywords": "оценить, результаты, модель, классификации, тестовых, данных, платформа, SMILE"
    },
    "255": {
        "question": "Какие шаги необходимо выполнить для добавления узла оценки модели классификации в рабочем пространстве на платформе SMILE?",
        "keywords": "шаги, добавление, узла, оценки, модели, классификации, рабочем, пространстве, платформа, SMILE"
    },
    "256": {
        "question": "Какие модели категории Scorer доступны для оценки результатов моделей регрессии на платформе SMILE?",
        "keywords": "модели, Scorer, оценка, регрессии, платформа, SMILE"
    },
    "257": {
        "question": "Что делать после получения оценки модели на тестовых данных на платформе SMILE для улучшения качества предсказаний?",
        "keywords": "оценка, модель, тестовых, данных, платформа, улучшение, качества, предсказаний, SMILE"
    },
    "258": {
        "question": "Какие преимущества предоставляет пользователю модальное окно с оценкой модели на платформе SMILE?",
        "keywords": "преимущества, модальное, окно, оценка, модель, платформа, SMILE"
    },
    "259": {
        "question": "Какие рекомендации можно дать пользователю для выбора метрики оценки модели в зависимости от конкретной задачи на платформе SMILE?",
        "keywords": "рекомендации, выбор, метрика, оценки, модели, задача, платформа, SMILE"
    },
    "260": {
        "question": "Что представляет собой AutoML решение на платформе SMILE и для чего оно используется?",
        "keywords": "AutoML, решение, платформа, SMILE, используется"
    },
    "261": {
        "question": "Какие задачи машинного обучения можно решать с помощью AutoML на платформе SMILE?",
        "keywords": "задачи, машинного, обучения, AutoML, платформа, SMILE"
    },
    "262": {
        "question": "Какие основные шаги необходимо выполнить для построения пайплайна с использованием AutoML на платформе SMILE?",
        "keywords": "шаги, построения, пайплайна, использование, AutoML, платформа, SMILE"
    },
    "263": {
        "question": "Какие алгоритмы машинного обучения доступны в категории AutoML на платформе SMILE?",
        "keywords": "алгоритмы, машинного, обучения, доступны, категория, AutoML, платформа, SMILE"
    },
    "264": {
        "question": "Что нужно сделать после добавления алгоритма AutoML на граф в Редакторе на платформе SMILE?",
        "keywords": "нужно, сделать, после, добавления, алгоритма, AutoML, граф, Редакторе, платформа, SMILE"
    },
    "265": {
        "question": "Какие параметры модели можно настроить в расширенных настройках узла \"Модель\" при использовании AutoML на платформе SMILE?",
        "keywords": "параметры, модели, настроить, расширенных, настройках, узла, \"Модель\", использование, AutoML, платформа, SMILE"
    },
    "266": {
        "question": "Как выбрать метрику для оценки модели в параметрах AutoML решения на платформе SMILE?",
        "keywords": "выбрать, метрику, оценка, модель, параметры, AutoML, платформа, SMILE"
    },
    "267": {
        "question": "Как установить ограничение времени расчета (Timeout) для модели FEDOT в AutoML на платформе SMILE?",
        "keywords": "установить, ограничение, время, расчета, Timeout, модель, FEDOT, AutoML, платформа, SMILE"
    },
    "268": {
        "question": "Какие дополнительные параметры имеют модели TpotModel и AutoKeras в AutoML на платформе SMILE?",
        "keywords": "дополнительные, параметры, TpotModel, AutoKeras, AutoML, платформа, SMILE"
    },
    "269": {
        "question": "Почему важно разделять данные на тренировочную и тестовую выборки перед применением AutoML на платформе SMILE?",
        "keywords": "разделять, данные, тренировочная, тестовая, выборки, применение, AutoML, платформа, SMILE"
    },
    "270": {
        "question": "Какие шаги необходимо предпринять для оценки модели на тестовой выборке после использования AutoML на платформе SMILE?",
        "keywords": "шаги, оценка, модели, тестовой, выборке, использование, AutoML, платформа, SMILE"
    },
    "271": {
        "question": "Какие преимущества предоставляет пользователю возможность запуска узла с AutoML моделью на платформе SMILE?",
        "keywords": "преимущества, возможность, запуска, узла, AutoML, модель, платформа, SMILE"
    },
    "272": {
        "question": "Какие результаты отображаются в Редакторе после расчета узла с моделью AutoML на платформе SMILE?",
        "keywords": "результаты, отображаются, Редакторе, после, расчета, узла, модель, AutoML, платформа, SMILE"
    },
    "273": {
        "question": "Что представляют собой новые узлы фиолетового цвета, которые появляются в графе после использования AutoML на платформе SMILE?",
        "keywords": "узлы, фиолетового, цвета, появляются, графе, после, использования, AutoML, платформа, SMILE"
    },
    "274": {
        "question": "Какие информационные панели доступны пользователю после применения AutoML модели на платформе SMILE?",
        "keywords": "информационные, панели, доступны, пользователю, после, применения, AutoML, модель, платформа, SMILE"
    },
    "275": {
        "question": "Какие действия необходимо выполнить после нажатия кнопки \"Перезагрузить граф\" при использовании узла с AutoML моделью на платформе SMILE?",
        "keywords": "действия, выполнить, после, нажатия, кнопки, \"Перезагрузить, граф\", при, использовании, узла, AutoML, модель, платформа, SMILE"
    },
    "276": {
        "question": "Какие типичные задачи можно решить с помощью AutoML решений на платформе SMILE?",
        "keywords": "AutoML, задачи, решение, платформа, SMILE"
    },
    "277": {
        "question": "Какие преимущества AutoML решений на платформе SMILE относительно ручной настройки моделей машинного обучения?",
        "keywords": "AutoML, преимущества, ручная, настройка, модели, машинного, обучения, платформа, SMILE"
    },
    "278": {
        "question": "Какие основные характеристики данных следует рассматривать перед выбором модели кластеризации на платформе SMILE?",
        "keywords": "характеристики, данных, выбор, модель, кластеризации, платформа, SMILE"
    },
    "279": {
        "question": "В чем заключается принципиальное отличие между задачей кластеризации и классификации в контексте машинного обучения?",
        "keywords": "кластеризации, классификация, принципиальное, отличие, задача, машинного, обучения"
    },
    "280": {
        "question": "Какие алгоритмы масштабирования данных рекомендуется использовать перед применением моделей кластеризации на платформе SMILE?",
        "keywords": "алгоритмы, масштабирования, данных, рекомендуется, применение, моделей, кластеризации, платформа, SMILE"
    },
    "281": {
        "question": "Как пользователю платформы SMILE выбрать оптимальное количество кластеров для задачи кластеризации?",
        "keywords": "выбрать, количество, кластеров, задача, кластеризации"
    },
    "282": {
        "question": "Какие методы визуализации данных могут помочь в определении количества кластеров перед применением моделей кластеризации?",
        "keywords": "методы, визуализации, данных, определение, количество, кластеров"
    },
    "283": {
        "question": "В чем заключается преимущество использования метода PCA при подготовке данных для моделей кластеризации на платформе SMILE?",
        "keywords": "преимущество, метод, PCA, подготовка, данных, модели, кластеризации"
    },
    "284": {
        "question": "Какие практические шаги необходимо предпринять для добавления модели кластеризации в граф Редактора на платформе SMILE?",
        "keywords": "практические, шаги, добавление, модель, кластеризации, граф, Редактора"
    },
    "285": {
        "question": "Какие критерии оценки качества моделей кластеризации доступны на платформе SMILE и как они используются?",
        "keywords": "критерии, оценки, качество, модели, кластеризации, доступны, используются"
    },
    "286": {
        "question": "Какие аспекты важно учитывать при интерпретации результатов кластеризации на платформе SMILE?",
        "keywords": "аспекты, учитывать, интерпретация, результаты, кластеризации, платформа, SMILE"
    },
    "287": {
        "question": "В каких случаях рекомендуется использовать экспертное мнение для оценки результатов кластеризации, а в каких — количественные показатели?",
        "keywords": "экспертное, мнение, оценка, результаты, кластеризации, количественные, показатели"
    },
    "288": {
        "question": "Какие этапы включает в себя построение Baseline модели вручную на платформе SMILE?",
        "keywords": "этапы, построение, Baseline, модель, вручную, платформа, SMILE"
    },
    "289": {
        "question": "Какие алгоритмы разделения данных на обучающую и тестовую выборки доступны в категории ModelSelection на платформе SMILE?",
        "keywords": "алгоритмы, разделение, данных, обучающая, тестовая, выборки, доступны, категория, ModelSelection, платформа, SMILE"
    },
    "290": {
        "question": "Какие параметры необходимо настроить при использовании модели TrainAndTest для разделения данных на обучающую и тестовую выборки?",
        "keywords": "параметры, настроить, модель, TrainAndTest, разделение, данных, обучающая, тестовая, выборки"
    },
    "291": {
        "question": "В чем заключается роль параметра Test_Size при использовании модели TrainAndTest на платформе SMILE?",
        "keywords": "роль, параметр, Test_Size, модель, TrainAndTest, платформа, SMILE"
    },
    "292": {
        "question": "Какие дополнительные параметры помогают улучшить качество разделения данных при использовании модели TrainAndTest?",
        "keywords": "дополнительные, параметры, улучшить, качество, разделения, данных, модель, TrainAndTest"
    },
    "293": {
        "question": "В чем заключается основное преимущество использования кросс-валидации при построении Baseline модели на платформе SMILE?",
        "keywords": "основное, преимущество, использование, кросс-валидация, построении, Baseline, модель, платформа, SMILE"
    },
    "294": {
        "question": "Какой инструмент в категории Iterations Tool необходимо выбрать для применения кросс-валидации на платформе SMILE?",
        "keywords": "инструмент, категории, Iterations Tool, выбор, применение, кросс-валидация, платформа, SMILE"
    },
    "295": {
        "question": "Какие параметры необходимо настроить в узле CrossValScorer перед применением кросс-валидации?",
        "keywords": "параметры, настроить, узле, CrossValScorer, применение, кросс-валидация"
    },
    "296": {
        "question": "Какие метрики оценки моделей доступны в узле CrossValScorer на платформе SMILE?",
        "keywords": "метрики, оценка, модели, узел, CrossValScorer, платформа, SMILE"
    },
    "297": {
        "question": "Какие преимущества дает использование автоматической настройки гиперпараметров модели на платформе SMILE?",
        "keywords": "преимущества, автоматическая, настройка, гиперпараметры, модель, платформа, SMILE"
    },
    "298": {
        "question": "Какие методы автоматической настройки гиперпараметров доступны в категории Iterations Tool на платформе SMILE?",
        "keywords": "методы, автоматическая, настройка, гиперпараметров, категория, Iterations Tool, платформа, SMILE"
    },
    "299": {
        "question": "Какие параметры необходимо настроить в узле GridSearchCV для проведения поиска по сетке гиперпараметров модели?",
        "keywords": "параметры, настроить, узел, GridSearchCV, поиск, сетке, гиперпараметров, модель"
    },
    "300": {
        "question": "Как использовать узел RandomizedSearchCV для эффективного поиска гиперпараметров модели на платформе SMILE?",
        "keywords": "использование, узел, RandomizedSearchCV, эффективный, поиск, гиперпараметры, модель, платформа, SMILE"
    },
    "301": {
        "question": "Какие основные этапы включает в себя процесс настройки гиперпараметров модели вручную на платформе SMILE?",
        "keywords": "этапы, настройка, гиперпараметры, модель, вручную, платформа, SMILE"
    },
    "302": {
        "question": "Какие преимущества дает использование узла BayesSearchCV при настройке гиперпараметров модели на платформе SMILE?",
        "keywords": "преимущества, использование, узел, BayesSearchCV, настройка, гиперпараметры, модель, платформа, SMILE"
    },
    "303": {
        "question": "Какие основные метрики качества модели рассматриваются при настройке гиперпараметров на платформе SMILE?",
        "keywords": "метрики, качество, модели, настройка, гиперпараметров, платформа, SMILE"
    },
    "304": {
        "question": "Какие функции включают в себя модели кросс-валидации на платформе SMILE?",
        "keywords": "функции, модели, кросс-валидации, платформа, SMILE"
    },
    "305": {
        "question": "Какие рекомендации по выбору значений или интервалов для гиперпараметров можно дать при настройке модели на платформе SMILE?",
        "keywords": "рекомендации, выбор, значения, интервалы, гиперпараметры, настройка, модель, платформа, SMILE"
    },
    "306": {
        "question": "Каким образом на платформе SMILE можно визуализировать процесс разделения данных при построении Baseline модели?",
        "keywords": "визуализировать, разделения, данных, Baseline, модель"
    },
    "307": {
        "question": "Какие основные шаги необходимо предпринять после выбора оптимальных гиперпараметров для модели на платформе SMILE?",
        "keywords": "предпринять, после, гиперпараметров, модели"
    },
    "308": {
        "question": "В чем основное отличие между тренировочными и тестовыми данными при построении модели на платформе SMILE?",
        "keywords": "отличие, тренировочными, тестовыми, данных"
    },
    "309": {
        "question": "Какие возможные проблемы могут возникнуть при использовании автоматической настройки гиперпараметров модели на платформе SMILE?",
        "keywords": "проблемы, автоматической, настройки, гиперпараметров, модели"
    },
    "310": {
        "question": "Какие факторы следует учитывать при выборе метрик оценки качества моделей на платформе SMILE?",
        "keywords": "факторы, выбор, метрик, оценки, качества, моделей"
    },
    "311": {
        "question": "Какие возможности предоставляет платформа SMILE для анализа и интерпретации результатов построенной модели?",
        "keywords": "возможности, платформа SMILE, анализ, интерпретация, модели"
    },
    "312": {
        "question": "Какие задачи машинного обучения поддерживает функция автоматического построения Baseline на платформе SMILE?",
        "keywords": "задачи машинного обучения, автоматическое построение Baseline, платформа SMILE"
    },
    "313": {
        "question": "В чем заключается основное преимущество автоматизированного построения Baseline на платформе SMILE?",
        "keywords": "преимущество, автоматизированное построение Baseline, платформа SMILE"
    },
    "314": {
        "question": "Какие параметры задачи машинного обучения можно настроить перед запуском автоматизированного построения Baseline?",
        "keywords": "параметры, задача машинного обучения, настроить, автоматизированное построение Baseline"
    },
    "315": {
        "question": "Как пользователю загрузить данные в проект для использования функции автоматического построения Baseline?",
        "keywords": "пользователь, загрузить данные, проект, автоматическое построение Baseline"
    },
    "316": {
        "question": "Какие шаги необходимо выполнить после размещения данных на графе для начала построения Baseline на платформе SMILE?",
        "keywords": "размещение, данные, граф, Baseline, платформа, SMILE"
    },
    "317": {
        "question": "Какие действия требуются после анализа данных для дальнейшего улучшения предложенного Baseline?",
        "keywords": "анализ, данные, улучшение, Baseline"
    },
    "318": {
        "question": "Как пользователь может настроить выбор целевого столбца перед автоматическим построением Baseline?",
        "keywords": "настройка, целевой, столбец, автоматическое, Baseline"
    },
    "319": {
        "question": "Каким образом пользователь может адаптировать предложенный Baseline под свои специфические требования?",
        "keywords": "адаптация, Baseline, специфические, требования"
    },
    "320": {
        "question": "Какие возможности предоставляет функция чекбоксов для выборочного отключения алгоритмов в предложенном Baseline?",
        "keywords": "возможности, чекбоксы, отключение, алгоритмов, Baseline"
    },
    "321": {
        "question": "Как происходит добавление выбранных узлов Baseline на графе в модуль на платформе SMILE?",
        "keywords": "добавление, узлов, Baseline, графе, модуль, платформа, SMILE"
    },
    "322": {
        "question": "Какие действия необходимо предпринять, чтобы выбрать модель для работы в workflow на платформе?",
        "keywords": "действия, выбрать, модель, workflow, платформа"
    },
    "323": {
        "question": "Что происходит, когда пользователь добавляет новый узел модели на поверхность workflow, но модель не выбрана?",
        "keywords": "добавляет, новый, узел, модель, поверхность, workflow, не выбрана"
    },
    "324": {
        "question": "Каким образом можно выбрать конкретную модель на платформе SMILE, используя популярные модели?",
        "keywords": "выбрать, модель, платформа, SMILE, популярные, модели"
    },
    "325": {
        "question": "Как пользователь может узнать о всех доступных моделях на платформе, если их количество превышает 250?",
        "keywords": "пользователь, узнать, доступные, модели, платформа, количество, превышает, 250"
    },
    "326": {
        "question": "Какие основные параметры модели отображаются после её выбора на платформе SMILE?",
        "keywords": "параметры, модели, отображаются, выбор, платформа, SMILE"
    },
    "327": {
        "question": "Что необходимо сделать, чтобы модель начала работать на платформе после её выбора?",
        "keywords": "модель, работать, платформа, после, выбор"
    },
    "328": {
        "question": "Как происходит передача входных данных модели через ориентированное ребро на платформе SMILE?",
        "keywords": "передача, входных, данных, модели, ребро, платформа, SMILE"
    },
    "329": {
        "question": "Какие параметры модели можно настроить, например, в параметрах столбцов для кодирования на платформе SMILE?",
        "keywords": "параметры, модели, настроить, параметры, столбцов, кодирования, платформа, SMILE"
    },
    "330": {
        "question": "Где пользователь может найти более детальное описание и документацию по выбранной модели на платформе?",
        "keywords": "пользователь, найти, описание, документация, выбранной, модель, платформа"
    }
}